posts/getting-started-with-clack/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Getting started with clack | Clack Tutorial</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://jasom.github.io/clack-tutorial/posts/getting-started-with-clack/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Jason Miller">
<link rel="next" href="../clack-file-upoad/" title="Clack File Uploads" type="text/html">
<meta property="og:site_name" content="Clack Tutorial">
<meta property="og:title" content="Getting started with clack">
<meta property="og:url" content="https://jasom.github.io/clack-tutorial/posts/getting-started-with-clack/">
<meta property="og:description" content="Clack is a very simple framework for unifying the different lisp web
application servers.  However there isn't a lot of documentation for
it.  This page hopes to address this.



Annotated examples of">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-03-26T23:36:28-07:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">Clack Tutorial</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Getting started with clack</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Jason Miller
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2017-03-26T23:36:28-07:00" itemprop="datePublished" title="2017-03-26 23:36">2017-03-26 23:36</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Clack is a very simple framework for unifying the different lisp web
application servers.  However there isn't a lot of documentation for
it.  This page hopes to address this.
</p>

<div id="outline-container-org553d171" class="outline-2">
<h2 id="org553d171">Annotated examples of usage</h2>
<div class="outline-text-2" id="text-org553d171">
</div>
<div id="outline-container-org7abf068" class="outline-3">
<h3 id="org7abf068">Formatting</h3>
<div class="outline-text-3" id="text-org7abf068">
<p>
All input and output are presented in monospaced preformatted blocks.
The color indicates what sort they are:
</p>

<div class="highlight"><pre><span></span><span class="s">"Lisp code has a gray background; it can be typed at the REPL"</span>
</pre></div>

<pre class="example">
NIL
</pre>


<div class="sh">
<div class="highlight"><pre><span></span>: shell code has a green background, it can be typed at a shell prompt
</pre></div>
</div>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="nb">format</span> <span class="no">t</span> <span class="s">"Output from running commands has a yellow background; do not type this"</span><span class="p">)</span>
</pre></div>

<pre class="example">
Output from running commands has a yellow background; do not type this
</pre>
</div>
</div>

<div id="outline-container-org73f0f02" class="outline-3">
<h3 id="org73f0f02">Load dependencies used in examples:</h3>
<div class="outline-text-3" id="text-org73f0f02">
<div class="highlight"><pre><span></span>   <span class="p">(</span><span class="nv">ql:quickload</span> <span class="o">'</span><span class="p">(</span><span class="nv">clack</span> <span class="nv">alexandria</span> <span class="nv">optima</span><span class="p">))</span>
   <span class="p">(</span><span class="nb">use-package</span> <span class="ss">:optima</span><span class="p">)</span>
</pre></div>

<pre class="example">
To load "clack":
  Load 1 ASDF system:
    clack
; Loading "clack"
...
To load "alexandria":
  Load 1 ASDF system:
    alexandria
; Loading "alexandria"

To load "optima":
  Load 1 ASDF system:
    optima
; Loading "optima"

</pre>
</div>
</div>

<div id="outline-container-org57c9b46" class="outline-3">
<h3 id="org57c9b46">Start a simple server</h3>
<div class="outline-text-3" id="text-org57c9b46">
<p>
The only required argument for <code>clackup</code> is the application; the
simplest form of the application is a function of one argument.
</p>

<p>
The function should retun a list of the form (<i>http-response-code</i> <i>http-headers-alist</i> <i>&amp;optional</i> <i>body</i>)
</p>

<p>
<i>body</i> can be a vector of <code>(unsigned-byte 8)</code>, a pathname, or a list of strings.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="nb">defparameter</span> <span class="vg">*clack-server*</span> <span class="p">(</span><span class="nv">clack:clackup</span> <span class="p">(</span><span class="k">lambda</span> <span class="p">(</span><span class="nv">env</span><span class="p">)</span>
                                         <span class="o">'</span><span class="p">(</span><span class="mi">200</span> <span class="no">nil</span> <span class="p">(</span><span class="s">"Hello, World!"</span><span class="p">)))))</span>
</pre></div>

<pre class="example">
Hunchentoot server is started.
Listening on localhost:5000.
</pre>



<p>
Let's test it with curl:
</p>

<div class="sh">
<div class="highlight"><pre><span></span>   curl -s http://localhost:5000
</pre></div>
</div>

<pre class="example">
Hello, World!
</pre>
</div>
</div>

<div id="outline-container-org5c5c854" class="outline-3">
<h3 id="org5c5c854">Stop the server</h3>
<div class="outline-text-3" id="text-org5c5c854">
<div class="highlight"><pre><span></span>     <span class="p">(</span><span class="nv">clack:stop</span> <span class="vg">*clack-server*</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-org57ecf2c" class="outline-3">
<h3 id="org57ecf2c">Redefining the handler</h3>
<div class="outline-text-3" id="text-org57ecf2c">
<p>
It's a bit of a pain to have to restart the server all the time, let's make a redefinable handler:
</p>
<div class="highlight"><pre><span></span>     <span class="p">(</span><span class="nb">defun</span> <span class="nv">handler</span> <span class="p">(</span><span class="nv">env</span><span class="p">)</span> <span class="o">'</span><span class="p">(</span><span class="mi">200</span> <span class="no">nil</span> <span class="p">(</span><span class="s">"Hello World, redefinable!"</span><span class="p">)))</span>
</pre></div>

<p>
And start the server; we call the function by name to allow redefinition
</p>
<div class="highlight"><pre><span></span>    <span class="p">(</span><span class="nb">defparameter</span> <span class="vg">*clack-server*</span>
      <span class="p">(</span><span class="nv">clack:clackup</span> <span class="p">(</span><span class="k">lambda</span> <span class="p">(</span><span class="nv">env</span><span class="p">)</span> <span class="p">(</span><span class="nb">funcall</span> <span class="ss">'handler</span> <span class="nv">env</span><span class="p">))))</span>
</pre></div>

<pre class="example">
Hunchentoot server is started.
Listening on localhost:5000.
</pre>


<p>
Check that it works…
</p>
<div class="sh">
<div class="highlight"><pre><span></span>   curl -s http://localhost:5000
</pre></div>
</div>

<pre class="example">
Hello World, redefinable!
</pre>


<p>
Now let's redefine it and take a look at what is in the environment:
</p>
<div class="highlight"><pre><span></span>     <span class="p">(</span><span class="nb">defun</span> <span class="nv">handler</span> <span class="p">(</span><span class="nv">env</span><span class="p">)</span>
       <span class="o">`</span><span class="p">(</span><span class="mi">200</span> <span class="no">nil</span> <span class="p">(</span><span class="o">,</span><span class="p">(</span><span class="nb">prin1-to-string</span> <span class="nv">env</span><span class="p">))))</span>
</pre></div>

<p>
View results…
</p>
<div class="sh">
<div class="highlight"><pre><span></span>   curl -s http://localhost:5000
</pre></div>
</div>

<pre class="example">
(:REQUEST-METHOD :GET :SCRIPT-NAME "" :PATH-INFO "/" :SERVER-NAME "localhost"
 :SERVER-PORT 5000 :SERVER-PROTOCOL :HTTP/1.1 :REQUEST-URI "/" :URL-SCHEME
 "http" :REMOTE-ADDR "127.0.0.1" :REMOTE-PORT 53824 :QUERY-STRING NIL :RAW-BODY
 #&lt;FLEXI-STREAMS:FLEXI-IO-STREAM {1021B536E3}&gt; :CONTENT-LENGTH NIL
 :CONTENT-TYPE NIL :CLACK.STREAMING T :CLACK.IO
 #&lt;CLACK.HANDLER.HUNCHENTOOT::CLIENT {1021B537F3}&gt; :HEADERS
 #&lt;HASH-TABLE :TEST EQUAL :COUNT 3 {1021B53C13}&gt;)
</pre>


<p>
This is the core part of clack; the environment plist.
</p>

<p>
Documentation for it is available <a href="https://github.com/fukamachi/lack#the-environment">in the lack README</a>
</p>

<p>
The fact that it is a plist means capturing values of interest can be done with <code>destructuring-bind</code>:
</p>

<div class="highlight"><pre><span></span>  <span class="p">(</span><span class="nb">defun</span> <span class="nv">handler</span> <span class="p">(</span><span class="nv">env</span><span class="p">)</span>
    <span class="p">(</span><span class="nb">destructuring-bind</span> <span class="p">(</span><span class="k">&amp;key</span> <span class="nv">request-method</span> <span class="nv">path-info</span> <span class="nv">request-uri</span>
                              <span class="nv">query-string</span> <span class="nv">headers</span> <span class="k">&amp;allow-other-keys</span><span class="p">)</span>
        <span class="nv">env</span>
      <span class="o">`</span><span class="p">(</span><span class="mi">200</span>
        <span class="no">nil</span>
        <span class="p">(</span><span class="o">,</span><span class="p">(</span><span class="nb">format</span> <span class="no">nil</span> <span class="s">"Method: ~S Path: ~S URI: ~A Query: ~S~%Headers: ~S"</span>
                  <span class="nv">request-method</span> <span class="nv">path-info</span> <span class="nv">request-uri</span> <span class="nv">query-string</span>
                  <span class="p">(</span><span class="nv">alexandria:hash-table-alist</span> <span class="nv">headers</span><span class="p">))))))</span>
</pre></div>

<div class="sh">
<div class="highlight"><pre><span></span>curl -s http://localhost:5000
</pre></div>
</div>

<pre class="example">
Method: :GET Path: "/" URI: / Query: NIL
Headers: (("accept" . "*/*") ("user-agent" . "curl/7.53.0")
          ("host" . "localhost:5000"))
</pre>


<p>
Optima can be useful too:
</p>
<div class="highlight"><pre><span></span>  <span class="p">(</span><span class="nb">defun</span> <span class="nv">handler</span> <span class="p">(</span><span class="nv">env</span><span class="p">)</span>
    <span class="p">(</span><span class="nv">optima:match</span> <span class="nv">env</span>
      <span class="p">((</span><span class="nv">guard</span> <span class="p">(</span><span class="nv">property</span> <span class="ss">:path-info</span> <span class="nv">path</span><span class="p">)</span>
              <span class="p">(</span><span class="nv">alexandria:starts-with-subseq</span> <span class="s">"/foo/"</span> <span class="nv">path</span><span class="p">))</span>
       <span class="o">`</span><span class="p">(</span><span class="mi">200</span> <span class="no">nil</span> <span class="p">(</span><span class="o">,</span><span class="p">(</span><span class="nb">format</span> <span class="no">nil</span> <span class="s">"The path '~A' is in /foo/~%"</span> <span class="nv">path</span><span class="p">))))</span>
      <span class="p">((</span><span class="nv">guard</span> <span class="p">(</span><span class="nv">property</span> <span class="ss">:path-info</span> <span class="nv">path</span><span class="p">)</span>
              <span class="p">(</span><span class="nv">alexandria:starts-with-subseq</span> <span class="s">"/bar/"</span> <span class="nv">path</span><span class="p">))</span>
       <span class="o">`</span><span class="p">(</span><span class="mi">200</span> <span class="no">nil</span> <span class="p">(</span><span class="o">,</span><span class="p">(</span><span class="nb">format</span> <span class="no">nil</span> <span class="s">"The path '~A' is in /bar/~%"</span> <span class="nv">path</span><span class="p">))))</span>
      <span class="p">((</span><span class="nv">property</span> <span class="ss">:path-info</span> <span class="nv">path</span><span class="p">)</span>
       <span class="o">`</span><span class="p">(</span><span class="mi">404</span> <span class="no">nil</span> <span class="p">(</span><span class="o">,</span><span class="p">(</span><span class="nb">format</span> <span class="no">nil</span> <span class="s">"Path ~A not found~%"</span> <span class="nv">path</span><span class="p">))))))</span>
</pre></div>

<div class="sh">
<div class="highlight"><pre><span></span>   curl -s http://localhost:5000/foo/quux
   curl -s http://localhost:5000/bar/quux
   curl -s http://localhost:5000/baz/quux
</pre></div>
</div>

<pre class="example">
The path '/foo/quux' is in /foo/
The path '/bar/quux' is in /bar/
Path /baz/quux not found
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2245f0" class="outline-2">
<h2 id="orga2245f0">Public API</h2>
<div class="outline-text-2" id="text-orga2245f0">
</div>
<div id="outline-container-orgaf2c874" class="outline-3">
<h3 id="orgaf2c874">CLACK:CLACKUP</h3>
<div class="outline-text-3" id="text-orgaf2c874">
</div>
<div id="outline-container-org1fd8fed" class="outline-4">
<h4 id="org1fd8fed">Syntax:</h4>
<div class="outline-text-4" id="text-org1fd8fed">
<p>
<b>clackup</b> <i>app</i> <i>&amp;key</i> <i>server</i> <i>port</i> <i>debug</i> <i>silent</i>
<i>use-thread</i> <i>use-default-middlewares</i> <i>&amp;allow-other-keys</i>
</p>


<p>
=&gt; <i>handler</i>
</p>
</div>
</div>
<div id="outline-container-org0ceb397" class="outline-4">
<h4 id="org0ceb397">Arguments and Values:</h4>
<div class="outline-text-4" id="text-org0ceb397">
</div>
<ul class="org-ul">
<li>
<a id="org5a5a47d"></a><i>app</i>–A <i>designator</i> for a <i>function</i> of one argument;or a subclass of <code>lack.component:lack-component</code>;or a <i>pathname</i>; or a <i>string</i>.<br>
</li>

<li>
<a id="orgae5ea00"></a><i>server</i>–A symbol.  The default is <code>:hunchentoot</code><br>
</li>

<li>
<a id="org0d80dbd"></a><i>port</i>–An integer.  The default is 5000<br>
</li>

<li>
<a id="org314220e"></a><i>debug</i>–A boolean.  The default is <code>t</code><br>
</li>

<li>
<a id="orgf77bb28"></a><i>silent</i>–A boolean.  The default is <code>nil</code><br>
</li>

<li>
<a id="org41c01bc"></a><i>use-thread</i>–A boolean.  The default is <code>t</code> on systems that support threading and <code>nil</code> otherwise.<br>
</li>

<li>
<a id="orgc1f5857"></a><i>use-default-middlewares</i>–A boolean.  The default is <code>t</code><br>
</li>

<li>
<a id="orge99d394"></a><i>handler</i>–A clack.handler::handler.<br>
</li>
</ul>
</div>

<div id="outline-container-orgcb1efde" class="outline-4">
<h4 id="orgcb1efde">Description:</h4>
<div class="outline-text-4" id="text-orgcb1efde">
<p>
<code>clackup</code> starts a server using the backend designated by <i>server</i> on
port <i>port</i>.
</p>

<p>
<i>app</i> is used to build the handler chain for the server as follows:
</p>
<ul class="org-ul">
<li>If <i>app</i> is a function then it will be used directly, and called on each request with the requst environment as its only parameter</li>
<li>If <i>app</i> is a subclass of <code>lack.component:lack-component</code> then (lack.component:call <i>app</i> <i>environment</i>) will be called on every request</li>
<li>If <i>app</i> is a pathname then it will be treated as a lisp file to be evaluated.  The result of the last form of the file will be used as above</li>
<li>If <i>app</i> is a string, then it will be coerced to a pathname and used as above.</li>
<li>If <i>use-default-middlewares</i> is <i>true</i> then <i>app</i> will be wrapped by the default middlewares</li>
</ul>
<p>
<i>server</i> designates the backend to use; if the backend is not found,
then <code>clackup</code> will attempt to load it via <code>quicklisp</code> or <code>asdf</code>.
</p>

<p>
<i>port</i> specifies which port to listen on.
</p>

<p>
<i>debug</i> specifies that debug mode is on.  The results of this is
backend specific, but typically will handle all errors in the body of
<i>app</i> by returning a 500 response to the user if <i>false</i>
</p>

<p>
<i>silent</i> Suppresses printing of status messages.
</p>

<p>
<i>use-thread</i> If <i>true</i>, the backend is launched in a separate thread.
</p>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="next">
                <a href="../clack-file-upoad/" rel="next" title="Clack File Uploads">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:jasom@fastmail.com">Jason Miller</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
